index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-04-09 Do 12:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Video conferencing and Remote Learning at the MCMP</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Conrad Friedrich" />
</head>
<body>
<div id="content">
<h1 class="title">Video conferencing and Remote Learning at the MCMP</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd847b15">1. For Video Calls, Workshops, Colloquia, Seminars, Classrooms, &#x2026;</a>
<ul>
<li><a href="#org45ce0b4">1.1. <span class="todo TODO">TODO</span> Workout advantages of LMU account.</a></li>
<li><a href="#org0853f95">1.2. Using Zoom: Example</a></li>
<li><a href="#org85f8f57">1.3. Features</a></li>
<li><a href="#orgdf21797">1.4. Recommendations:</a></li>
</ul>
</li>
<li><a href="#org66a2109">2. For Lectures</a></li>
<li><a href="#org0221457">3. FAQ</a>
<ul>
<li><a href="#org001514c">3.1. Why Zoom and not alternatives? Google Meet, Skype etc.</a></li>
<li><a href="#org75d6d8b">3.2. <span class="todo TODO">TODO</span> More information on the LMU's stance on different products.</a></li>
<li><a href="#org087ba3c">3.3. Aren't there security concerns with Zoom?</a></li>
<li><a href="#org732269a">3.4. What's with Zoom webinars?</a></li>
</ul>
</li>
<li><a href="#orgc31f051">4. Alternative for Video Calls: Jitsi Meet</a>
<ul>
<li><a href="#orgad83e98">4.1. Features</a></li>
<li><a href="#orge5c726c">4.2. Recommendations</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
These comments are hopefully helpful to those people at the MCMP planning to do some academic philosophy and to teach remotely. These comments are very much work in progress. We're thankful for questions or changes and additions. Contact: (conrad.friedrich at lmu dot de)<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>. 
</p>

<p>
The LMU has approved of some conferencing software described below but <b>disallowed the use of Skype, Facetime</b> and similar for teaching and official communication.<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>
</p>

<div id="outline-container-orgd847b15" class="outline-2">
<h2 id="orgd847b15"><span class="section-number-2">1</span> For Video Calls, Workshops, Colloquia, Seminars, Classrooms, &#x2026;</h2>
<div class="outline-text-2" id="text-1">
<p>
Recommendation: Zoom meetings
</p>

<p>
<a href="https://lmu-munich.zoom.us/">https://lmu-munich.zoom.us/</a>
</p>

<p>
Up to 300 participants
</p>

<p>
Regulations apply.<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup>
</p>

<p>
For almost all use cases, we recommend using Zoom meetings. It promises to be reliable, easy-to-use, and to have enough features to accommodate most academic needs. Using a one-stop solution comes with the additional benefit that e.g. students only have be familiar with one software package in order to take part in the classes. 
</p>

<p>
To start using Zoom, follow the link above and login with your lmu credentials. You'll be able to schedule and start meetings as well as change your settings there. The Zoom account through LMU has a couple of advantages over the free 'basic' Zoom account. 
</p>
</div>

<div id="outline-container-org45ce0b4" class="outline-3">
<h3 id="org45ce0b4"><span class="section-number-3">1.1</span> <span class="todo TODO">TODO</span> Workout advantages of LMU account.</h3>
</div>

<div id="outline-container-org0853f95" class="outline-3">
<h3 id="org0853f95"><span class="section-number-3">1.2</span> Using Zoom: Example</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Let's consider a use case similar to <a href="https://www.youtube.com/watch?v=HCo5ZX0G5ls">this video by Eric Pacuit</a>. We'd like to show a presentation and annotate the slides by hand. To do so, open the slides you want to present in your favorite software. In a Zoom meeting, choose 'Share Screen' and choose your presentation software in the following dialogue (for example Preview for slides in pdf format on macOS). Participants can now follow the slides of your presentation. In the Zoom toolbar, you can choose 'Annotate' and then 'Draw' to annotate your slides with your input device. Alternatively, you can use the annotation feature of your presentation software, if it has it (e.g. Preview for macOS offers annotations). With a mouse, this works tolerable, but you might achieve better results with a graphic tablet that simulates writing with pen and paper digitally. We bought a small batch of <code>XP-Pen Star G640</code><sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup> at the MCMP if you'd like to use one. If you need assistance setting it up, we're happy to help. It's probably a good idea to familiarize yourself with these features a bit before starting your class.
</p>
</div>
</div>

<div id="outline-container-org85f8f57" class="outline-3">
<h3 id="org85f8f57"><span class="section-number-3">1.3</span> Features</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Free through LMU.</li>
<li>Requires installation of App (Windows, Mac, Linux, iOS, Android) or browser-extension.</li>
<li>No Account required (except host).</li>
<li>Scheduling of events</li>
<li>Video/audio conferencing, screen sharing (e.g. for powerpoints), whiteboard.</li>
<li>Moderating: mutings users, 'raising hand' feature, chat.</li>
<li>Security: passwords for meetings, waiting room for new participants to prevent 'zoom bombing', general data privacy concerns (see below), no end-to-end-decryption.</li>
<li>Server location undisclosed</li>
<li>Proprietary software.</li>
</ul>
</div>
</div>

<div id="outline-container-orgdf21797" class="outline-3">
<h3 id="orgdf21797"><span class="section-number-3">1.4</span> Recommendations:</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Since Zoom is in high demand at the moment, users might receive so-called phishing emails that might look official but contain links to fraudulent websites. Always verify the domain ends in <code>zoom.us</code> when you enter your credentials on a website.</li>
<li>Always set a password for your meeting! Share the password through external channels (like mail).</li>
<li>To increase performance and save bandwidth, consider deactivating video and audio streams of participants currently not talking.</li>
</ul>
<p>
The LMU IT in addition recommends the following settings for meetings:<sup><a id="fnr.3.100" class="footref" href="#fn.3">3</a></sup>
</p>
<ul class="org-ul">
<li>Deactivate file transfer</li>
<li>Deactivate participant feedback function</li>
<li>Allow virtual background</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org66a2109" class="outline-2">
<h2 id="org66a2109"><span class="section-number-2">2</span> For Lectures</h2>
<div class="outline-text-2" id="text-2">
<p>
Recommendation: LMUCast
</p>

<p>
<a href="https://cast.itunes.uni-muenchen.de/">https://cast.itunes.uni-muenchen.de/</a>
</p>

<p>
If you plan to do a larger lecture, the general plan is to prerecord them and the students then follow the lecture at home with additional interactions through message boards etc. The LMU offers an optional service to film the lectures in a lecture hall. If there is any need for this type of teaching, we're happy to assist in coordinating with the LMU.
</p>
</div>
</div>

<div id="outline-container-org0221457" class="outline-2">
<h2 id="org0221457"><span class="section-number-2">3</span> FAQ</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org001514c" class="outline-3">
<h3 id="org001514c"><span class="section-number-3">3.1</span> Why Zoom and not alternatives? Google Meet, Skype etc.</h3>
<div class="outline-text-3" id="text-3-1">
<p>
The LMU IT has expressed but did not specify concerns with Skype and Facetime for privacy reasons.<sup><a id="fnr.2.100" class="footref" href="#fn.2">2</a></sup> 
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Product</th>
<th scope="col" class="org-left">LMU's stance on it for use in remote teaching</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Jitsi Meet</td>
<td class="org-left">Recommended</td>
</tr>

<tr>
<td class="org-left">Zoom</td>
<td class="org-left">Recommended</td>
</tr>

<tr>
<td class="org-left">Adobe Connect</td>
<td class="org-left">Recommended<sup><a id="fnr.5" class="footref" href="#fn.5">5</a></sup></td>
</tr>

<tr>
<td class="org-left">Microsoft Teams</td>
<td class="org-left">Currently in evaluation</td>
</tr>

<tr>
<td class="org-left">Skype</td>
<td class="org-left">Explicitly Disallowed</td>
</tr>

<tr>
<td class="org-left">Facetime</td>
<td class="org-left">Explicitly Disallowed</td>
</tr>

<tr>
<td class="org-left">Cisco WebEx</td>
<td class="org-left">None so far</td>
</tr>

<tr>
<td class="org-left">GoToMeeting</td>
<td class="org-left">None so far</td>
</tr>

<tr>
<td class="org-left">Google Hangouts</td>
<td class="org-left">None so far</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org75d6d8b" class="outline-3">
<h3 id="org75d6d8b"><span class="section-number-3">3.2</span> <span class="todo TODO">TODO</span> More information on the LMU's stance on different products.</h3>
</div>

<div id="outline-container-org087ba3c" class="outline-3">
<h3 id="org087ba3c"><span class="section-number-3">3.3</span> Aren't there security concerns with Zoom?</h3>
<div class="outline-text-3" id="text-3-3">
<p>
There are, and it's important to stay on top of things. At the moment, long as some precautions are met (like setting a password for your meeting), the benefits outweigh the risks involved. For a review, see <a href="https://www.cs.columbia.edu/~smb/blog/2020-04/2020-04-06.html">Steven Bellovin (Columbia) write about this</a>. See <a href="https://blogs.harvard.edu/doc/2020/03/27/zoom">Doc Searls</a> for a critical stance on some of Zoom's privacy issues. 
</p>
</div>
</div>
<div id="outline-container-org732269a" class="outline-3">
<h3 id="org732269a"><span class="section-number-3">3.4</span> What's with Zoom webinars?</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li>Quite expensive, only limited licenses through LMU. If we have need for it, we can apply for it at the LMU IT.</li>
<li>More geared towards teacher-centered teaching than meetings.</li>
<li>Has more features to moderate users if there are lots of disturbances.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgc31f051" class="outline-2">
<h2 id="orgc31f051"><span class="section-number-2">4</span> Alternative for Video Calls: Jitsi Meet</h2>
<div class="outline-text-2" id="text-4">
<p>
If you put particular emphasis on data protection and privacy, the LMU also recommends an alternative tool called Jitsi Meet.
</p>

<p>
<a href="https://meet.lrz.de">https://meet.lrz.de</a>
</p>

<p>
Recommended (by LMU IT) number of participants up to 15 
</p>
</div>

<div id="outline-container-orgad83e98" class="outline-3">
<h3 id="orgad83e98"><span class="section-number-3">4.1</span> Features</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>Free and open source (FOSS) software.</li>
<li>Hosted by the LRZ (IT department of the LMU) in Germany.</li>
<li>No setup required.</li>
<li>No account required (except host).</li>
<li>Runs directly in the browser (Chrome, Firefox), additionally iOS and Android apps.</li>
<li>Video/audio conferencing, screen sharing, no whiteboard.</li>
<li>Moderating: muting users, 'raising hand' feature, chat.</li>
<li>Security: passwords for session (has to be activated manually, slightly hidden), no end-to-end encryption.</li>
<li>Easily shareable URLs consisting of four random words.</li>
<li>No scheduling</li>
<li>New participants can be set to muted and without video upon joining.</li>
</ul>
</div>
</div>

<div id="outline-container-orge5c726c" class="outline-3">
<h3 id="orge5c726c"><span class="section-number-3">4.2</span> Recommendations</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>Mute yourself with <code>M</code> and unmute temporarily by holding <code>SPACE</code>. (Push to talk - decreases noise levels during the call)</li>
<li>Set a password! Using the browser on main screen click the small (i) in the button right and 'add password'.</li>
</ul>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
Or for the technically minded, post a pull request for <a href="https://github.com/conradfriedrich/remote-philosophy">this repository</a>.
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="https://www.itg.uni-muenchen.de/service/zoom/index.html">https://www.itg.uni-muenchen.de/service/zoom/index.html</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
<a href="https://www.it-servicedesk.uni-muenchen.de/it-angebote/zoom/nutzung_datenschutz/index.html">https://www.it-servicedesk.uni-muenchen.de/it-angebote/zoom/nutzung_datenschutz/index.html</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4">4</a></sup> <div class="footpara"><p class="footpara">
Download the drivers at <a href="https://www.xp-pen.de/download-244.html">https://www.xp-pen.de/download-244.html</a>.
</p></div></div>

<div class="footdef"><sup><a id="fn.5" class="footnum" href="#fnr.5">5</a></sup> <div class="footpara"><p class="footpara">
<code>Adobe Connect</code> requires <code>Adobe Flash Player</code>, which is outdated.
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Conrad Friedrich</p>
<p class="date">Created: 2020-04-09 Do 12:14</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
